# Задание 1.
#
# Спортсмен занимается ежедневными пробежками.
# В первый день его результат составил a километров.
# Каждый день спортсмен увеличивал результат на 10 % относительно предыдущего.
# Требуется определить номер дня,
# на который результат спортсмена составит не менее b километров.
# Программа должна принимать значения параметров a и b
# и выводить одно натуральное число — номер дня.

a = int(input("Введите нач.результат: "))
b = int(input("Введите конечный результат: "))
day = 1
print (day, "-й день: ", round(a, 3))
while b - a > 0:
    a = a + (a * 0.1)
    day += 1
    print(day, "-й день: ", round(a, 3))
# вывод результата
print(f"На {day}-й день спортсмен достиг результата — не менее {b} км")