"""Задание 2.
Пользователь вводит время в секундах.
Переведите время в часы, минуты и секунды и выведите в формате чч:мм:сс.
Используйте форматирование строк """

import time

m = int(input("Введите врем в секундах"))
time_format = time.strftime("%H:%M:%S", time.gmtime(m))
print("Время в формате:-", time_format)
