# Задание 4.
# Запросите у пользователя значения выручки и издержек фирмы.
# Определите, с каким финансовым результатом работает фирма
# (прибыль — выручка больше издержек, или убыток — издержки больше выручки).
# Выведите соответствующее сообщение. Если фирма отработала с прибылью,
# вычислите рентабельность выручки (соотношение прибыли к выручке).
# Далее запросите численность сотрудников фирмы и определите
# прибыль фирмы в расчете на одного сотрудника.

revenue = int(input("Введите значение выручки:"))
costs = int(input("Введите издержки фирмы: "))
if (revenue > costs):
    a = revenue - costs
    print("Финансовый результат - Прибыль: ", a)
    rent = a / revenue
    print("Рентабельность:", rent)
    staffer = int(input("Введите численность сотрудников:"))
    b = a / staffer
    print("Прибыль на одноо сотрудника:", b)
else:
    b = revenue - costs
    print("Финансовый результат - Убыток:", b)
