# Пользователь вводит строку из нескольких слов,
# разделённых пробелами. Вывести каждое слово с новой строки.
# Строки необходимо пронумеровать. Если слово длинное,
# выводить только первые 10 букв в слове.

my_list = input("Введите слова через пробел: ").split()
counter = 1
for word in my_list:
    if len(word) > 10:
        print(f"{counter} - {word[:10]}")
    else:
        print(f"{counter} - {word}")
    counter += 1
