# Задание 1.
# Поработайте с переменными, создайте несколько,
# выведите на экран, запросите у пользователя несколько чисел и
# строк и сохраните в переменные, выведите на экран.

name = input("Введите Ваше имя:")
password = input("Введите пароль:")
age = input("Введите Ваш возраст:")
print(
    "Ваше имя: " + name + ", ваш пароль: " + password + ", ваш возврат: " + age)

