# Найти сумму n элементов следующего ряда чисел:
# 1 -0.5 0.25 -0.125 ...
# Количество элементов (n) вводится с клавиатуры.


n = int(input('Введите кол-во итераций:'))


def rec(i, num, n):
    if i == n:
        return num
    elif i <= n:
        return rec(i + 1, num / (-2), n)


print(rec(0, 1, n))
